OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/include/mcs51/cc2530.h
//
//// From Table 23-5 : CC253x Radio Register Overview
//
SFRX(FRMFILT0,   0x6180); // Frame Filtering
SFRX(FRMFILT1,   0x6181); // Frame Filtering
SFRX(SRCMATCH,   0x6182); // Source Address Matching and Pending Bits
SFRX(SRCSHORTEN0,0x6183); // Short Address Matching
SFRX(SRCSHORTEN1,0x6184); // Short Address Matching
SFRX(SRCSHORTEN2,0x6185); // Short Address Matching
SFRX(SRCEXTEN0,  0x6186); // Extended Address Matching
SFRX(SRCEXTEN1,  0x6187); // Extended Address Matching
SFRX(SRCEXTEN2,  0x6188); // Extended Address Matching
SFRX(FRMCTRL0,   0x6189); // Frame Handling
SFRX(FRMCTRL1,   0x618A); // Frame Handling
SFRX(RXENABLE,   0x618B); // RX Enabling
SFRX(RXMASKSET,  0x618C); // RX Enabling
SFRX(RXMASKCLR,  0x618D); // RX Disabling
SFRX(FREQTUNE,   0x618E); // Crystal Oscillator Frequency Tuning
SFRX(FREQCTRL,   0x618F); // Controls the RF Frequency
SFRX(TXPOWER,    0x6190); // Controls the Output Power
SFRX(TXCTRL,     0x6191); // Controls the TX Settings
SFRX(FSMSTAT0,   0x6192); // Radio Status Register
SFRX(FSMSTAT1,   0x6193); // Radio Status Register
SFRX(FIFOPCTRL,  0x6194); // FIFOP Threshold
SFRX(FSMCTRL,    0x6195); // FSM Options
SFRX(CCACTRL0,   0x6196); // CCA Threshold
SFRX(CCACTRL1,   0x6197); // Other CCA Options
SFRX(RSSI,       0x6198); // RSSI Status Register
SFRX(RSSISTAT,   0x6199); // RSSI Valid Status Register
SFRX(RXFIRST,    0x619A); // First Byte in RXFIFO
SFRX(RXFIFOCNT,  0x619B); // Number of Bytes in RXFIFO
SFRX(TXFIFOCNT,  0x619C); // Number of Bytes in TXFIFO
SFRX(RXFIRST_PTR,0x619D); // RXFIFO Pointer
SFRX(RXLAST_PTR, 0x619E); // RXFIFO Pointer
SFRX(RXP1_PTR,   0x619F); // RXFIFO Pointer
SFRX(TXFIRST_PTR,0x61A1); // TXFIFO Pointer
SFRX(TXLAST_PTR, 0x61A2); // TXFIFO Pointer
SFRX(RFIRQM0,    0x61A3); // RF Interrupt Masks
SFRX(RFIRQM1,    0x61A4); // RF Interrupt Masks
SFRX(RFERRM,     0x61A5); // RF Error Interrupt Mask
SFRX(OPAMPMC,    0x61A6); // Operational amplifier mode control
SFRX(RFRND,      0x61A7); // Random Data
SFRX(MDMCTRL0,   0x61A8); // Controls Modem
SFRX(MDMCTRL1,   0x61A9); // Controls Modem
SFRX(FREQEST,    0x61AA); // Estimated RF Frequency Offset
SFRX(RXCTRL,     0x61AB); // Tune Receive Section
SFRX(FSCTRL,     0x61AC); // Tune Frequency Synthesizer
SFRX(FSCAL1,     0x61AE); // Tune Frequency Calibration
SFRX(FSCAL2,     0x61AF); // Tune Frequency Calibration
SFRX(FSCAL3,     0x61B0); // Tune Frequency Calibration
SFRX(AGCCTRL0,   0x61B1); // AGC Dynamic Range Control
SFRX(AGCCTRL1,   0x61B2); // AGC Reference Level
SFRX(AGCCTRL2,   0x61B3); // AGC Gain Override
SFRX(AGCCTRL3,   0x61B4); // AGC Control
SFRX(ADCTEST0,   0x61B5); // ADC Tuning
SFRX(ADCTEST1,   0x61B6); // ADC Tuning
SFRX(ADCTEST2,   0x61B7); // ADC Tuning
SFRX(MDMTEST0,   0x61B8); // Test Register for Modem
SFRX(MDMTEST1,   0x61B9); // Test Register for Modem
SFRX(DACTEST0,   0x61BA); // DAC Override Value
SFRX(DACTEST1,   0x61BB); // DAC Override Value
SFRX(DACTEST2,   0x61BC); // DAC Test Setting
SFRX(ATEST,      0x61BD); // Analog Test Control
SFRX(PTEST0,     0x61BE); // Override Power-Down Register
SFRX(PTEST1,     0x61BF); // Override Power-Down Register
SFRX(CSPPROG0,   0x61C0); // CSP Program 0
SFRX(CSPPROG1,   0x61C1); // CSP Program 1
SFRX(CSPPROG2,   0x61C2); // CSP Program 2
SFRX(CSPPROG3,   0x61C3); // CSP Program 3
SFRX(CSPPROG4,   0x61C4); // CSP Program 4
SFRX(CSPPROG5,   0x61C5); // CSP Program 5
SFRX(CSPPROG6,   0x61C6); // CSP Program 6
SFRX(CSPPROG7,   0x61C7); // CSP Program 7
SFRX(CSPPROG8,   0x61C8); // CSP Program 8
SFRX(CSPPROG9,   0x61C9); // CSP Program 9
SFRX(CSPPROG10,  0x61CA); // CSP Program 10
SFRX(CSPPROG11,  0x61CB); // CSP Program 11
SFRX(CSPPROG12,  0x61CC); // CSP Program 12
SFRX(CSPPROG13,  0x61CD); // CSP Program 13
SFRX(CSPPROG14,  0x61CE); // CSP Program 14
SFRX(CSPPROG15,  0x61CF); // CSP Program 15
SFRX(CSPPROG16,  0x61D0); // CSP Program 16
SFRX(CSPPROG17,  0x61D1); // CSP Program 17
SFRX(CSPPROG18,  0x61D2); // CSP Program 18
SFRX(CSPPROG19,  0x61D3); // CSP Program 19
SFRX(CSPPROG20,  0x61D4); // CSP Program 20
SFRX(CSPPROG21,  0x61D5); // CSP Program 21
SFRX(CSPPROG22,  0x61D6); // CSP Program 22
SFRX(CSPPROG23,  0x61D7); // CSP Program 23
SFRX(CSPCTRL,    0x61E0); // CSP Control Bit
SFRX(CSPSTAT,    0x61E1); // CSP Status Register
SFRX(CSPX,       0x61E2); // CSP X Register
SFRX(CSPY,       0x61E3); // CSP Y Register
SFRX(CSPZ,       0x61E4); // CSP Z Register
SFRX(CSPT,       0x61E5); // CSP T Register
SFRX(RFC_OBS_CTRL0, 0x61EB); // RF Observation Mux Control
SFRX(RFC_OBS_CTRL1, 0x61EC); // RF Observation Mux Control
SFRX(RFC_OBS_CTRL2, 0x61ED); // RF Observation Mux Control
SFRX(TXFILTCFG,  0x61FA); // TX Filter Configuration

#endif //REG_CC2530_H
